# GetNetAdapterInfo

## Description
Return information about the network adapter

```pascal
FUNCTION GetNetAdapterInfo(
				adapterIndex   : INTEGER;
				VAR outMacAddr : STRING) : BOOLEAN;
```

```python

def vs.GetNetAdapterInfo(adapterIndex):
    return (BOOLEAN, outMacAddr)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|adapterIndex|INTEGER||
|outMacAddr|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* Utility